doc digram use mermaid
Signed-off-by: Avelino <31996+avelino@users.noreply.github.com>
